products_with_price = [
    {
        'name': 'Смартфон Xiaomi Redmi 9C NFC 3/64 ГБ',
        'description': 'Смартфон',
        'price': 8999,
        'category': 'Смартфоны'
    },
    {
        'name': 'Смартфон Poco Poco X4 Pro 5G 6/128 ГБ',
        'description': '''
                        Тип: Смартфон
                        Диагональ экрана, дюймы: 6.67
                        Емкость аккумулятора, мАч: 5000
                        Процессор: Snapdragon 695 (8 ядер), 2.2 ГГц
                        Основной материал корпуса: Пластик
                       ''',
        'price': 31990,
        'category': 'Смартфоны'
    },
    {
        'name': 'Смартфон Xiaomi Note 11 Pro 8/128 ГБ',
        'description': '''
                        Тип: Смартфон
                        Диагональ экрана, дюймы: 6.67
                        Емкость аккумулятора, мАч: 5000
                        Процессор: Helio G96 (8 ядер), 2.05 ГГц
                        Основной материал корпуса: Пластик, Стекло
                       ''',
        'price': 26990,
        'category': 'Смартфоны'
    },
    {
        'name': 'Планшет Apple iPad Pro 11(2022) Wi-Fi, 11", 128GB, темно-серый',
        'description': '''
                        Диагональ экрана, дюймы: 11
                        Тип: Планшет
                        Беспроводные интерфейсы: Bluetooth, GPS, Wi-Fi
                        Встроенная память, ГБ: 128
                        Разрешение экрана: 2388x1668
                       ''',
        'price': 112000,
        'category': 'Планшеты'
    },
    {
        'name': 'Планшет Xiaomi Redmi Pad, 10.61", 128GB, серый',
        'description': '''
                        Тип: Планшет
                        Диагональ экрана, дюймы: 10.61
                        Беспроводные интерфейсы: Bluetooth, Wi-Fi
                        Встроенная память, ГБ: 128
                        Оперативная память: 4 ГБ
                       ''',
        'price': 18999,
        'category': 'Планшеты'
    },
    {
        'name': 'Планшет Samsung Galaxy Tab A7 Lite LTE, 8.7", 32GB, темно-серый',
        'description': '''
                        Диагональ экрана, дюймы: 8.7
                        Тип: Планшет
                        Беспроводные интерфейсы: Bluetooth, Wi-Fi
                        Встроенная память, ГБ: 32
                        Оперативная память: 3 ГБ
                       ''',
        'price': 13000,
        'category': 'Планшеты'
    },
    {
        'name': '15.6" Ноутбук Echips Envy 15.6" 1920x1080 IPS Intel J4125 512 GB, Intel Celeron J4125 (2.0 ГГц), RAM 8 ГБ, SSD 512 ГБ, Intel HD Graphics 600, Windows Pro',
        'description': '''
                        Процессор: Intel Celeron J4125 (2.0 ГГц)
                        Оперативная память: 8 ГБ
                        Общий объем SSD, ГБ: 512
                        Видеокарта: Intel HD Graphics 600
                        Операционная система: Windows Pro
                        ''',
        'price': 39990,
        'category': 'Ноутбуки'
    },
    {
        'name': '13.3" Ноутбук Apple MacBook Air, Apple M1 (8C CPU, 7C GPU), RAM 8 ГБ, SSD 256 ГБ, macOS, (MGN93RU/A), Silver',
        'description': '''
                        Процессор: Apple M1 (8C CPU, 7C GPU)
                        Оперативная память: 8 ГБ
                        Общий объем SSD, ГБ: 256
                        Операционная система: macOS
                        Диагональ экрана, дюймы: 13.3
                        ''',
        'price': 79990,
        'category': 'Ноутбуки'
    },
    {
        'name': '16.3" Ноутбук UZZAI HJC-N5105-16GB-2TB, RAM 16 ГБ, SSD 2048 ГБ, Intel UHD Graphics, Windows Pro',
        'description': '''
                        Оперативная память: 16 ГБ
                        Общий объем SSD, ГБ: 2048
                        Общий объем HDD, ГБ: 2048
                        Видеокарта: Intel UHD Graphics
                        Операционная система: Windows Pro
                        ''',
        'price': 34200,
        'category': 'Ноутбуки'
    },
    {
        'name': 'Встраиваемый телевизор, Телевизор BBK 223 55" 4K HDR, черный',
        'description': '''
                        Тип: Телевизор, Встраиваемый телевизор
                        Диагональ экрана, дюймы: 55
                        Разрешение: 3840x2160 4K
                        Smart TV: Да
                        Тип подсветки: Direct LED
                        ''',
        'price': 15000,
        'category': 'Телевизоры'
    },
    {
        'name': 'Телевизор Samsung UE32N4000 32" HD, черный',
        'description': '''
                        Тип: Телевизор
                        Диагональ экрана, дюймы: 32
                        Разрешение: 1280x720 HD
                        Smart TV: Нет
                        Тип подсветки: Direct LED
                        ''',
        'price': 20990,
        'category': 'Телевизоры'
    },
    {
        'name': 'Телевизор Hartens HTY-32HDRO6G-HK22 32" HD, серый',
        'description': '''
                        Тип: Телевизор
                        Диагональ экрана, дюймы: 32
                        Разрешение: 1366x768 HD
                        Smart TV: Да
                        Тип подсветки: Direct LED
                        ''',
        'price': 10000,
        'category': 'Телевизоры'
    },
    {
        'name': 'Умные часы Смарт часы X8 Ultra, 48mm',
        'description': '''
                        Диагональ экрана, дюймы: 1.9
                        Разрешение экрана: 3648x2736
                        Беспроводные интерфейсы: NFC, Wi-Fi, Bluetooth, GPS
                        Совместимость: Android, Mac OS, PC, Chrome OS
                        Защита от влаги: Да
                        ''',
        'price': 5000,
        'category': 'Смарт-часы'
    },
    {
        'name': 'Умные часы Premium Series 8 Ultra, 49mm, черный',
        'description': '''
                        Диагональ экрана, дюймы: 2.08
                        Разрешение экрана: 410x502
                        Беспроводные интерфейсы: Bluetooth, GPS, NFC, Wi-Fi
                        Совместимость: Android, iOS, Windows Phone
                        Защита от влаги: Да
                        ''',
        'price': 2562,
        'category': 'Смарт-часы'
    },
    {
        'name': 'Умные часы Smart Watch смарт часы ZX-19, 41mm, золото',
        'description': '''
                        Диагональ экрана, дюймы: 1.45
                        Разрешение экрана: 320x240
                        Беспроводные интерфейсы: Bluetooth
                        Совместимость: Android, iOS
                        Защита от влаги: Да
                        ''',
        'price': 6100,
        'category': 'Смарт-часы'
    },
    {
        'name': 'Холодильник Bosfor RF 063, белый',
        'description': '''
                        Общий объем, л: 67
                        Тип: Холодильник
                        Размеры, мм (ШхГхВ): 630х510х445
                        Размораживание: Ручное
                        Класс энергопотребления: A+
                        ''',
        'price': 6000,
        'category': 'Холодильники'
    },
    {
        'name': 'Холодильник Midea MDRD86SLF Ретро, однокамерный, белый',
        'description': '''
                        Общий объем, л: 48
                        Тип: Холодильник
                        Размеры, мм (ШхГхВ): 485 x 440 x 500
                        Размораживание: Ручное
                        Класс энергопотребления: A+
                        ''',
        'price': 16999,
        'category': 'Холодильники'
    },
    {
        'name': 'Холодильник Samsung RB30A30N0SA, серебристый, серебристый',
        'description': '''
                        Общий объем, л: 311
                        Тип: Холодильник
                        Размеры, мм (ШхГхВ): 595 x 675 x 1780
                        Размораживание: No frost
                        Класс энергопотребления: A+\
                        ''',
        'price': 35820,
        'category': 'Холодильники'
    },
    {
        'name': 'Настольная плита Kitfort KT-107 индукционная',
        'description': '''
                        Тип панели (плиты): Индукционная
                        Количество конфорок: 1
                        Потребляемая мощность, Вт: 1800
                        Тип управления: Электронное
                        Материал рабочей поверхности: Стеклокерамика
                        ''',
        'price': 2742,
        'category': 'Плиты'
    },
    {
        'name': 'Стеклокерамическая плита Weissgauff WES E2V16 WE',
        'description': '''
                        Тип конфорок: Электрические
                        Тип духовки: Электрический
                        Ширина плиты, см: 50
                        Глубина плиты, см: 60
                        Объем духовки, л: 50
                        ''',
        'price': 21500,
        'category': 'Плиты'
    },
    {
        'name': 'Электрическая Плита ECON ECO-131HP, белый',
        'description': '''
                        Тип панели (плиты): Электрическая
                        Количество конфорок: 1
                        Потребляемая мощность, Вт: 1000
                        Тип управления: Механическое
                        Материал рабочей поверхности: Эмалированная сталь
                        ''',
        'price': 1000,
        'category': 'Плиты'
    },
    {
        'name': 'Утюг Tefal Express Steam FV2837E0, белый, синий',
        'description': '''
                        Мощность, Вт: 2400
                        Паровой удар, г/мин: 165
                        Подача пара, г/мин: 35
                        Покрытие подошвы: Керамическое
                        Вертикальное отпаривание: Да
                        ''',
        'price': 2715,
        'category': 'Утюги'
    },
    {
        'name': 'Утюг Tefal EXPRESS STEAM, черный, красный',
        'description': '''
                        Мощность, Вт: 2400
                        Паровой удар, г/мин: 180
                        Подача пара, г/мин: 40
                        Покрытие подошвы: Керамическое
                        Вертикальное отпаривание: Да
                        ''',
        'price': 4590,
        'category': 'Утюги'
    },
    {
        'name': 'Беспроводной утюг GARLYN GT-240',
        'description': '''
                        Мощность, Вт: 2400
                        Паровой удар, г/мин: 170
                        Подача пара, г/мин: 40
                        Покрытие подошвы: Керамическое
                        Вертикальное отпаривание: Да
                        ''',
        'price': 6095,
        'category': 'Утюги'
    },
    {
        'name': 'Ультразвуковой увлажнитель воздуха Polaris PUH 8105 TF, белый, золотой',
        'description': '''
                        Вид увлажнителя: Ультразвуковой
                        Производительность, л/ч: 0.35
                        Объем, мл: 5000
                        Бренд: Polaris
                        Макс. площадь помещения, кв.м: 40
                        ''',
        'price': 11000,
        'category': 'Увлажнители воздуха',
    },
    {
        'name': 'Увлажнитель воздуха H2O',
        'description': '''
                        Вид увлажнителя: Паровой
                        Производительность, л/ч: 0.03
                        Объем, мл: 300
                        Макс. площадь помещения, кв.м: 20
                        Обеззараживание воздуха: Ионизация''',
        'price': 1600,
        'category': 'Увлажнители воздуха',
    },
    {
        'name': 'Увлажнитель воздуха I.G.Store Воздухоочиститель маленький с увлажнителем, черный',
        'description': '''
                        Производительность, л/ч: 0.025
                        Объем, мл: 300
                        Макс. площадь помещения, кв.м: 25
                        Бренд: I.G.Store
                        Настройка влажности: Автоматическое поддержание влажности
                        ''',
        'price': 500,
        'category': 'Увлажнители воздуха',
    },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # },
    # {
    #     'name': '',
    #     'description': '''''',
    #     'price': 0,
    #     'category': 'Смарт-часы'
    # }

]
